<?php

namespace Database\Seeders;

use App\Models\Product;
use Illuminate\Database\Seeder;

class ProductSeeder extends Seeder
{
    public function run()
    {
        $products = [
            [
                'name' => 'Курс по реакту',
                'description' => 'React — самая популярная библиотека для фронтенд-разработки.
                А ещё это стабильный фреймфорк, который легко поддерживать: поэтому на нём пишут большие популярные веб-приложения.
                Разработчикам, которые умеют использовать React, обычно проще искать работу и получать повышения.',
                'price' => 800,
                'image' => 'kursreact.webp',
                'images' => json_encode(['kursreact.webp', 'kursreact2.webp']),
                'category' => 'kurs',
                'is_popular' => true
            ],
             [
                'name' => 'Курс по js',
                'description' => 'Освоите востребованный язык программирования и сможете начать работать уже через 7 месяцев обучения
                Научитесь создавать IT-проекты у экспертов из VK и Сбера, попрактикуетесь на индивидуальных и групповых задачах
                Добавите в портфолио 8 проектов и поработаете над реальными кейсами',
                'price' => 500,
                'image' => 'kursjs.webp',
                'images' => json_encode(['kursjs.webp', 'kursjs2.webp']),
                'category' => 'kurs',
                'is_popular' => true
            ],
            [
                'name' => 'Шаблон свадебный',
                'description' => 'Это электронное онлайн пригласительное в виде сайта с уникальным дизайном и доступом 24/7 на любом устройстве.
                Гости получат всю информацию о дне свадьбы: стиль, дресс-код, местоположение, план дня, предпочтения по подаркам, Ваши пожелания и т.д.',
                'price' => 80,
                'image' => 'svadba1.png',
                'images' => json_encode(['svadba1.png', 'svadba1.png']),
                'category' => 'shabl',
                'is_popular' => true
            ],
             [
                'name' => 'Книга Гарри Поттер',
                'description' => 'Гарри Поттеру предстоит четвертый год обучения в Школе чародейства и волшебства “Хогвартс”. Новые заклинания, новые зелья,
                 новые учителя, новые предметы… Все это знакомо, и Гарри с нетерпением ожидает начала учебного года. Но на школу внезапно обрушивается потрясающая 
                 новость: в этом году в Хогвартсе будет проходить Турнир Трех Волшебников, и конечно же, каждый хочет принять в нем участие…',
                'price' => 480,
                'image' => 'garry.webp',
                'images' => json_encode(['garry.webp', 'garry2.1.webp']),
                'category' => 'books',
                'is_popular' => true
            ],
             [
                'name' => 'Книга Властелин Колец',
                'description' => '
                Перед вами трилогия «Властелин Колец». Своеобразная «Библия от фэнтези». Книга Книг ХХ века. Самое популярное, самое читаемое,
                 самое культовое произведение ушедшего столетия.
                Во второй книге, «Две твердыни», отряд хранителей Кольца распадается, а война приходит на земли Рохана – государства вольных Всадников,
                 союзников Гондора.',
                'price' => 420,
                'image' => 'kolec.webp',
                'images' => json_encode(['kolec.webp', 'kolec2.webp']),
                'category' => 'books',
                'is_popular' => true
            ],
            [
                'name' => 'Шаблон приглашения',
                'description' => '
                Пригласительные открытки "День Рождения" представляют собой набор из 12 штук, напечатанных на плотной бумаге формата А6.
                Особенностью этих открыток является их двусторонний дизайн. Это позволяет использовать их с обеих сторон, что делает их еще более привлекательными и интересными для гостей.
                Пригласительные открытки "День Рождения" выполнены в бежевом цвете, что придает им утонченный и элегантный вид.',
                'price' => 220,
                'image' => 'dr1.webp',
                'images' => json_encode(['dr1.webp', 'dr2.webp']),
                'category' => 'shabl',
                'is_popular' => true
            ],
            [
                'name' => 'Шаблон презентации',
                'description' => 'Есть много способов добавить немного креативности в вашу презентацию. Чтобы помочь вам разработать потрясающий проект, 
                мы разработали для вас этот шаблон.
                Великолепный дизайн и полностью редактируемые слайды: настраивайте цветовую палитру, добавляйте фото в один клик, меняйте текст, таблицы и данные.',
                'price' => 180,
                'image' => 'preza1.jpg',
                'images' => json_encode(['preza1.jpg', 'preza1.1.jpg']),
                'category' => 'shabl',
                'is_popular' => true
            ],
            [
                'name' => 'Шаблон презентации',
                'description' => 'Используйте этот универсальный шаблон маркетинговой стратегии на goodslide.ru, чтобы поделиться своими целями с вашей командой, 
                привлечь инвесторов к своим маркетинговым планам или поразмышлять о текущем прогрессе. С макетами слайдов для организации вашей стратегии выхода 
                на рынок и расстановки приоритетов проектов, этот шаблон презентации содержит различные типы слайдов, которые соответствуют вашим потребностям.',
                'price' => 180,
                'image' => 'preza2.jpg',
                'images' => json_encode(['preza2.jpg', 'preza 2.1.jpg']),
                'category' => 'shabl',
                'is_popular' => true
            ],
            [
                'name' => 'Шаблон презентации',
                'description' => 'Когда дело доходит до годового отчета - шаблоны презентаций на goodslide.ru дадут вам лучший результат. Готовые шаблоны Бизнес 
                презентаций отлично подходят для ваших задач. Слайды содержат элементы инфографики, диаграммы, графики и иконки.',
                'price' => 180,
                'image' => 'preza3.jpg',
                'images' => json_encode(['preza3.jpg', 'preza3.1.jpg']),
                'category' => 'shabl',
                'is_popular' => true
            ],
            [
                'name' => 'Книга сталкер',
                'description' => '
                Снайпер сделал все, чтобы оживить своих погибших друзей.
                Совершил невозможное.
                И они ожили.
                Когда настоящий сталкер очень хочет чего-то, Зона обычно выполняет его желание.
                Только не придется ли после этого пожалеть о том, что оно сбылось?',
                'price' => 580,
                'image' => 'stalker.webp',
                'images' => json_encode(['stalker.webp', 'stalker2.webp']),
                'category' => 'books',
                'is_popular' => true
            ],
          
        ];

        foreach ($products as $product) {
            Product::create($product);
        }
    }
}